from aiogram import types
from aiogram.dispatcher.filters import Command
from aiogram.types import CallbackQuery, ReplyKeyboardRemove

from keyboards.default.even_odd import even_odd
from loader import bot
from keyboards.default.menu import menu
from keyboards.inline.weekdays import weekdays_odd, weekdays_even, returns
from keyboards.inline.weekdays_callback_data import weekdays_callback
from loader import dp
from utils.misc.datetime_func import is_odd, is_weekends, is_couple_of_lessons, today_is, tommorow_is


@dp.message_handler(Command("menu"))
async def show_menu(message: types.Message):
    await message.answer(text="Меню",reply_markup=menu)


@dp.message_handler(text="Полное расписание")
async def show_menu(message: types.Message):
    week = ""
    result = is_odd()
    if result == True:
        week = "Нечетная"
    elif result == False:
        week = "Четная"
    await message.answer(text=f"Выберите неделю.\n!Сейчас <b>{week}</b> неделя!", reply_markup=even_odd)


@dp.message_handler(text="Расписание на сегодня")
async def today_schedule(message: types.Message):
    result = today_is()
    if message.chat.id == 767509531:
        if result == "66":
            await message.answer("Сегодня выходной")
        elif result == "00":
            await message.answer(
                text="Расписание на понедельник \n<b>Нечетная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Высш. мат. пр.з. 7-17 нед. ст. пр. Александров Ю.Л. ауд.224\n\n<b>2 пара</b>(11.20-12.55) Высш. мат. пр.з. ст. пр. Александров Ю.Л.ауд.347\n\n<b>3 пара</b>(13.10-14.45) Ин. яз. пр.з.  1-15 нед. ауд.450\n\n<b>4 пара</b>(15.25-17.00) ТВиМС пр.з. ауд.224\n\n<b>5 пара</b>(17.15-18.50) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ ")
        elif result == "01":
            await message.answer(
                text="Расписание на вторник \n<b>Нечетная неделя</b>\n\n<b>4 пара</b>(15.25-17.00) Вычислительная техника лаб.дистанционно\n\n<b>5 пара</b>(17.15-18.50) Вычислительная техника лаб. дистанционно")
        elif result == "02":
            await message.answer(
                text="Расписание на среду\n<b>Нечетная неделя</b>\n\n1 пара</b>(9.30-11.05) Авиамоторная  лек. История развития средств связи   ст. пр. Калабекьянц Н.Э. ауд. УЛК-2\n\n<b>2 пара</b>(11.20-12.55) Авиамоторная  пр.з. История развития средств связи   ст. пр. Калабекьянц Н.Э. ауд. УЛК-2 \n\n<b>3 пара</b>(13.10-14.45)  Авиамоторная   лек. Высшая математика  ст. пр. Александров Ю.Л. Ауд. УЛК-2")
        elif result == "03":
            await message.answer(
                text="Расписание на четверг \n<b>Нечетная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Правоведение пр.з. доц. Антипов А.А.ауд.404\n\n<b>3 пара</b>(13.10-14.45) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ\n\n<b>4 пара</b>(15.25-17.00) Введение в ИТ лаб. ауд. 224\n\n<b>5 пара</b>(17.15-18.50) Введение в ИТ пр.з. ауд. 224")
        elif result == "04":
            await message.answer(
                text="Расписание на пятницу \n<b>Нечетная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Основы компьютерного анализа  ЭЦ лаб.\n\n<b>4 пара</b>(15.25-17.00) Электроника лаб. 525")
        elif result == "10":
            await message.answer(
                text="Расписание на понедельник \n<b>Четная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Высш. мат. пр.з. 7-17 нед. ст. пр. Александров Ю.Л. ауд.224\n\n<b>2 пара</b>(11.20-12.55) Высш. мат. пр.з. ст. пр. Александров Ю.Л.ауд.347\n\n<b>3 пара</b>(13.10-14.45) Ин. яз. пр.з.  1-15 нед. ауд.450\n\n<b>4 пара</b>(15.25-17.00) ТВиМС пр.з. ауд.224\n\n<b>5 пара</b>(17.15-18.50) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ ")
        elif result == "11":
            await message.answer(
                text="Расписание на вторник \n<b>Четная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Авиамоторная  лек.  Правоведение  доц. Антипов А.А. 2-14 нед. ауд.  УЛК-2\n\n<b>2 пара</b>(11.20-12.55) Авиамоторная  лекции   Введение в ИТ ауд. УЛК-2	\n\n<b>3 пара</b>(13.10-14.45) Авиамоторная   лек. Электроника  ст. пр.  Сретенская Н.В. ауд. УЛК-2 \n\n<b>4 пара</b>(15.25-17.00) Авиамоторная  лекции  Экология доц. Ерофеева В.В. 2-12 нед. ауд. УЛК-2 \n\n<b>5 пара</b>(17.15-18.50) Авиамоторная  лек.  Теория вероятностей и МС  доц. Панков К.Н.	ауд. УЛК-2")
        elif result == "12":
            await message.answer(
                text="Расписание на среду \n<b>Четная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Авиамоторная  лек. Вычислительная техника  ауд. УЛК-2 ст.пр. Селезнев В.С.\n\n<b>4 пара</b>(15.25-17.00) Авиамоторная   лек. Высшая математика  ст. пр. Александров Ю.Л. Ауд. УЛК-2")
        elif result == "13":
            await message.answer(
                text="Расписание на четверг \n<b>Четная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Экология лаб.339\n\n<b>3 пара</b>(13.10-14.45) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ\n\n<b>4 пара</b>(15.25-17.00) Введение в ИТ лаб. ауд. 224\n\n<b>5 пара</b>(17.15-18.50) Введение в ИТ пр.з. ауд. 224")
        elif result == "14":
            await message.answer(
                text="Расписание на пятницу \n<b>Четная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Основы компьютерного анализа  ЭЦ лаб.\n\n<b>4 пара</b>(15.25-17.00) Электроника лаб. 525")
    else:
        if result == "66":
            await message.answer("Сегодня выходной")
        elif result == "00":
            await message.answer(text="Расписание на понедельник \n<b>Нечетная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Высш. мат. пр.з. 7-17 нед. ст. пр. Александров Ю.Л. ауд.224\n\n<b>2 пара</b>(11.20-12.55) Высш. мат. пр.з. ст. пр. Александров Ю.Л.ауд.347\n\n<b>3 пара</b>(13.10-14.45) Ин. яз. пр.з.  1-15 нед. ауд.450\n\n<b>4 пара</b>(15.25-17.00) ТВиМС пр.з. ауд.224\n\n<b>5 пара</b>(17.15-18.50) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ ")
        elif result == "01":
            await message.answer(text="Расписание на вторник \n<b>Нечетная неделя</b>\n\n<b>4 пара</b>(15.25-17.00) Вычислительная техника лаб.дистанционно\n\n<b>5 пара</b>(17.15-18.50) Вычислительная техника лаб. дистанционно")
        elif result == "02":
            await message.answer(text="Расписание на среду \n<b>Нечетная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Авиамоторная  лек. История развития средств связи   ст. пр. Калабекьянц Н.Э. ауд. УЛК-2 \n\n<b>3 пара</b>(13.10-14.45) Авиамоторная   История развития средств связи пр.з. ауд. УЛК-2\n\n<b>4 пара</b>(15.25-17.00) Авиамоторная   лек. Высшая математика  ст. пр. Александров Ю.Л. Ауд. УЛК-2")
        elif result == "03":
            await message.answer(text="Расписание на четверг \n<b>Нечетная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Правоведение пр.з. доц. Антипов А.А.ауд.404\n\n<b>3 пара</b>(13.10-14.45) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ\n\n<b>4 пара</b>(15.25-17.00) Введение в ИТ лаб. ауд. 224\n\n<b>5 пара</b>(17.15-18.50) Введение в ИТ пр.з. ауд. 224")
        elif result == "04":
            await message.answer(text="Расписание на пятницу \n<b>Нечетная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Основы компьютерного анализа  ЭЦ лаб.\n\n<b>4 пара</b>(15.25-17.00) Электроника лаб. 525")
        elif result == "10":
            await message.answer(text="Расписание на понедельник \n<b>Четная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Высш. мат. пр.з. 7-17 нед. ст. пр. Александров Ю.Л. ауд.224\n\n<b>2 пара</b>(11.20-12.55) Высш. мат. пр.з. ст. пр. Александров Ю.Л.ауд.347\n\n<b>3 пара</b>(13.10-14.45) Ин. яз. пр.з.  1-15 нед. ауд.450\n\n<b>4 пара</b>(15.25-17.00) ТВиМС пр.з. ауд.224\n\n<b>5 пара</b>(17.15-18.50) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ ")
        elif result == "11":
            await message.answer(text="Расписание на вторник \n<b>Четная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Авиамоторная  лек.  Правоведение  доц. Антипов А.А. 2-14 нед. ауд.  УЛК-2\n\n<b>2 пара</b>(11.20-12.55) Авиамоторная  лекции   Введение в ИТ ауд. УЛК-2	\n\n<b>3 пара</b>(13.10-14.45) Авиамоторная   лек. Электроника  ст. пр.  Сретенская Н.В. ауд. УЛК-2 \n\n<b>4 пара</b>(15.25-17.00) Авиамоторная  лекции  Экология доц. Ерофеева В.В. 2-12 нед. ауд. УЛК-2 \n\n<b>5 пара</b>(17.15-18.50) Авиамоторная  лек.  Теория вероятностей и МС  доц. Панков К.Н.	ауд. УЛК-2")
        elif result == "12":
            await message.answer(text="Расписание на среду \n<b>Четная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Авиамоторная  лек. Вычислительная техника  ауд. УЛК-2 ст.пр. Селезнев В.С.\n\n<b>4 пара</b>(15.25-17.00) Авиамоторная   лек. Высшая математика  ст. пр. Александров Ю.Л. Ауд. УЛК-2")
        elif result == "13":
            await message.answer(text="Расписание на четверг \n<b>Четная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Экология лаб.339\n\n<b>3 пара</b>(13.10-14.45) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ\n\n<b>4 пара</b>(15.25-17.00) Введение в ИТ лаб. ауд. 224\n\n<b>5 пара</b>(17.15-18.50) Введение в ИТ пр.з. ауд. 224")
        elif result == "14":
            await message.answer(text="Расписание на пятницу \n<b>Четная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Основы компьютерного анализа  ЭЦ лаб.\n\n<b>4 пара</b>(15.25-17.00) Электроника лаб. 525")

@dp.message_handler(text="Расписание на завтра")
async def today_schedule(message: types.Message):
    result = tommorow_is()
    if message.chat.id == 767509531:
        if result == "66":
            await message.answer("Завтра выходной")
        elif result == "00":
            await message.answer(text="Расписание на понедельник \n<b>Нечетная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Высш. мат. пр.з. 7-17 нед. ст. пр. Александров Ю.Л. ауд.224\n\n<b>2 пара</b>(11.20-12.55) Высш. мат. пр.з. ст. пр. Александров Ю.Л.ауд.347\n\n<b>3 пара</b>(13.10-14.45) Ин. яз. пр.з.  1-15 нед. ауд.450\n\n<b>4 пара</b>(15.25-17.00) ТВиМС пр.з. ауд.224\n\n<b>5 пара</b>(17.15-18.50) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ ")
        elif result == "01":
            await message.answer(text="Расписание на вторник \n<b>Нечетная неделя</b>\n\n<b>4 пара</b>(15.25-17.00) Вычислительная техника лаб.дистанционно\n\n<b>5 пара</b>(17.15-18.50) Вычислительная техника лаб. дистанционно")
        elif result == "02":
            await message.answer(
                text="Расписание на среду\n<b>Нечетная неделя</b>\n\n1 пара</b>(9.30-11.05) Авиамоторная  лек. История развития средств связи   ст. пр. Калабекьянц Н.Э. ауд. УЛК-2\n\n<b>2 пара</b>(11.20-12.55) Авиамоторная  пр.з. История развития средств связи   ст. пр. Калабекьянц Н.Э. ауд. УЛК-2 \n\n<b>3 пара</b>(13.10-14.45)  Авиамоторная   лек. Высшая математика  ст. пр. Александров Ю.Л. Ауд. УЛК-2")
        elif result == "03":
            await message.answer(text="Расписание на четверг \n<b>Нечетная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Правоведение пр.з. доц. Антипов А.А.ауд.404\n\n<b>3 пара</b>(13.10-14.45) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ\n\n<b>4 пара</b>(15.25-17.00) Введение в ИТ лаб. ауд. 224\n\n<b>5 пара</b>(17.15-18.50) Введение в ИТ пр.з. ауд. 224")
        elif result == "04":
            await message.answer(text="Расписание на пятницу \n<b>Нечетная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Основы компьютерного анализа  ЭЦ лаб.\n\n<b>4 пара</b>(15.25-17.00) Электроника лаб. 525")
        elif result == "10":
            await message.answer(text="Расписание на понедельник \n<b>Четная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Высш. мат. пр.з. 7-17 нед. ст. пр. Александров Ю.Л. ауд.224\n\n<b>2 пара</b>(11.20-12.55) Высш. мат. пр.з. ст. пр. Александров Ю.Л.ауд.347\n\n<b>3 пара</b>(13.10-14.45) Ин. яз. пр.з.  1-15 нед. ауд.450\n\n<b>4 пара</b>(15.25-17.00) ТВиМС пр.з. ауд.224\n\n<b>5 пара</b>(17.15-18.50) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ ")
        elif result == "11":
            await message.answer(text="Расписание на вторник \n<b>Четная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Авиамоторная  лек.  Правоведение  доц. Антипов А.А. 2-14 нед. ауд.  УЛК-2\n\n<b>2 пара</b>(11.20-12.55) Авиамоторная  лекции   Введение в ИТ ауд. УЛК-2	\n\n<b>3 пара</b>(13.10-14.45) Авиамоторная   лек. Электроника  ст. пр.  Сретенская Н.В. ауд. УЛК-2 \n\n<b>4 пара</b>(15.25-17.00) Авиамоторная  лекции  Экология доц. Ерофеева В.В. 2-12 нед. ауд. УЛК-2 \n\n<b>5 пара</b>(17.15-18.50) Авиамоторная  лек.  Теория вероятностей и МС  доц. Панков К.Н.	ауд. УЛК-2")
        elif result == "12":
            await message.answer(text="Расписание на среду \n<b>Четная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Авиамоторная  лек. Вычислительная техника  ауд. УЛК-2 ст.пр. Селезнев В.С.\n\n<b>4 пара</b>(15.25-17.00) Авиамоторная   лек. Высшая математика  ст. пр. Александров Ю.Л. Ауд. УЛК-2")
        elif result == "13":
            await message.answer(text="Расписание на четверг \n<b>Четная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Экология лаб.339\n\n<b>3 пара</b>(13.10-14.45) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ\n\n<b>4 пара</b>(15.25-17.00) Введение в ИТ лаб. ауд. 224\n\n<b>5 пара</b>(17.15-18.50) Введение в ИТ пр.з. ауд. 224")
        elif result == "14":
            await message.answer(text="Расписание на пятницу \n<b>Четная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Основы компьютерного анализа  ЭЦ лаб.\n\n<b>4 пара</b>(15.25-17.00) Электроника лаб. 525")


    else:
        if result == "66":
            await message.answer("Завтра выходной")
        elif result == "00":
            await message.answer(text="Расписание на понедельник \n<b>Нечетная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Высш. мат. пр.з. 7-17 нед. ст. пр. Александров Ю.Л. ауд.224\n\n<b>2 пара</b>(11.20-12.55) Высш. мат. пр.з. ст. пр. Александров Ю.Л.ауд.347\n\n<b>3 пара</b>(13.10-14.45) Ин. яз. пр.з.  1-15 нед. ауд.450\n\n<b>4 пара</b>(15.25-17.00) ТВиМС пр.з. ауд.224\n\n<b>5 пара</b>(17.15-18.50) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ ")
        elif result == "01":
            await message.answer(text="Расписание на вторник \n<b>Нечетная неделя</b>\n\n<b>4 пара</b>(15.25-17.00) Вычислительная техника лаб.дистанционно\n\n<b>5 пара</b>(17.15-18.50) Вычислительная техника лаб. дистанционно")
        elif result == "02":
            await message.answer(text="Расписание на среду \n<b>Нечетная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Авиамоторная  лек. История развития средств связи   ст. пр. Калабекьянц Н.Э. ауд. УЛК-2 \n\n<b>3 пара</b>(13.10-14.45) Авиамоторная   История развития средств связи пр.з. ауд. УЛК-2\n\n<b>4 пара</b>(15.25-17.00) Авиамоторная   лек. Высшая математика  ст. пр. Александров Ю.Л. Ауд. УЛК-2")
        elif result == "03":
            await message.answer(text="Расписание на четверг \n<b>Нечетная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Правоведение пр.з. доц. Антипов А.А.ауд.404\n\n<b>3 пара</b>(13.10-14.45) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ\n\n<b>4 пара</b>(15.25-17.00) Введение в ИТ лаб. ауд. 224\n\n<b>5 пара</b>(17.15-18.50) Введение в ИТ пр.з. ауд. 224")
        elif result == "04":
            await message.answer(text="Расписание на пятницу \n<b>Нечетная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Основы компьютерного анализа  ЭЦ лаб.\n\n<b>4 пара</b>(15.25-17.00) Электроника лаб. 525")
        elif result == "10":
            await message.answer(text="Расписание на понедельник \n<b>Четная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Высш. мат. пр.з. 7-17 нед. ст. пр. Александров Ю.Л. ауд.224\n\n<b>2 пара</b>(11.20-12.55) Высш. мат. пр.з. ст. пр. Александров Ю.Л.ауд.347\n\n<b>3 пара</b>(13.10-14.45) Ин. яз. пр.з.  1-15 нед. ауд.450\n\n<b>4 пара</b>(15.25-17.00) ТВиМС пр.з. ауд.224\n\n<b>5 пара</b>(17.15-18.50) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ ")
        elif result == "11":
            await message.answer(text="Расписание на вторник \n<b>Четная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Авиамоторная  лек.  Правоведение  доц. Антипов А.А. 2-14 нед. ауд.  УЛК-2\n\n<b>2 пара</b>(11.20-12.55) Авиамоторная  лекции   Введение в ИТ ауд. УЛК-2	\n\n<b>3 пара</b>(13.10-14.45) Авиамоторная   лек. Электроника  ст. пр.  Сретенская Н.В. ауд. УЛК-2 \n\n<b>4 пара</b>(15.25-17.00) Авиамоторная  лекции  Экология доц. Ерофеева В.В. 2-12 нед. ауд. УЛК-2 \n\n<b>5 пара</b>(17.15-18.50) Авиамоторная  лек.  Теория вероятностей и МС  доц. Панков К.Н.	ауд. УЛК-2")
        elif result == "12":
            await message.answer(text="Расписание на среду \n<b>Четная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Авиамоторная  лек. Вычислительная техника  ауд. УЛК-2 ст.пр. Селезнев В.С.\n\n<b>4 пара</b>(15.25-17.00) Авиамоторная   лек. Высшая математика  ст. пр. Александров Ю.Л. Ауд. УЛК-2")
        elif result == "13":
            await message.answer(text="Расписание на четверг \n<b>Четная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Экология лаб.339\n\n<b>3 пара</b>(13.10-14.45) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ\n\n<b>4 пара</b>(15.25-17.00) Введение в ИТ лаб. ауд. 224\n\n<b>5 пара</b>(17.15-18.50) Введение в ИТ пр.з. ауд. 224")
        elif result == "14":
            await message.answer(text="Расписание на пятницу \n<b>Четная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Основы компьютерного анализа  ЭЦ лаб.\n\n<b>4 пара</b>(15.25-17.00) Электроника лаб. 525")


# @dp.message_handler(text="Аристов")
# async def faggot(message: types.Message):
#     await message.answer(text="Пидор")


@dp.message_handler(text="Время до конца пары")
async def couple_of_lessons(message: types.Message):
    weekends = is_weekends()
    if weekends == True:
        await message.answer("Сегодня выходной")
    else:
        result = is_couple_of_lessons()
        await message.answer(f"{result}")



@dp.message_handler(text="Нечетная")
async def odd_week(message: types.Message):
    await message.answer("Выберите день.\n Нечетная неделя",reply_markup=weekdays_odd)

@dp.message_handler(text="Четная")
async def odd_week(message: types.Message):
    await message.answer("Выберите день.\n Четная неделя",reply_markup=weekdays_even)


@dp.callback_query_handler(weekdays_callback.filter(weekday="monday_odd"))
async def monday_odd(call: CallbackQuery):
        await call.answer(cache_time=60)
        await call.message.answer(text="Расписание на понедельник \n<b>Нечетная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Высш. мат. пр.з. 7-17 нед. ст. пр. Александров Ю.Л. ауд.224\n\n<b>2 пара</b>(11.20-12.55) Высш. мат. пр.з. ст. пр. Александров Ю.Л.ауд.347\n\n<b>3 пара</b>(13.10-14.45) Ин. яз. пр.з.  1-15 нед. ауд.450\n\n<b>4 пара</b>(15.25-17.00) ТВиМС пр.з. ауд.224\n\n<b>5 пара</b>(17.15-18.50) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ ", reply_markup=returns)

@dp.callback_query_handler(weekdays_callback.filter(weekday="monday_even"))
async def monday_even(call: CallbackQuery):
    await call.answer(cache_time=60)
    await call.message.answer(text="Расписание на понедельник \n<b>Четная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Высш. мат. пр.з. 7-17 нед. ст. пр. Александров Ю.Л. ауд.224\n\n<b>2 пара</b>(11.20-12.55) Высш. мат. пр.з. ст. пр. Александров Ю.Л.ауд.347\n\n<b>3 пара</b>(13.10-14.45) Ин. яз. пр.з.  1-15 нед. ауд.450\n\n<b>4 пара</b>(15.25-17.00) ТВиМС пр.з. ауд.224\n\n<b>5 пара</b>(17.15-18.50) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ ",reply_markup=returns)


@dp.callback_query_handler(weekdays_callback.filter(weekday="tuesday_odd"))
async def tuesday_odd(call: CallbackQuery):
    await call.answer(cache_time=60)
    await call.message.answer(
        text="Расписание на вторник \n<b>Нечетная неделя</b>\n\n<b>4 пара</b>(15.25-17.00) Вычислительная техника лаб.дистанционно\n\n<b>5 пара</b>(17.15-18.50) Вычислительная техника лаб. дистанционно",reply_markup=returns)


@dp.callback_query_handler(weekdays_callback.filter(weekday="tuesday_even"))
async def tuesday_even(call: CallbackQuery):
    await call.answer(cache_time=60)
    await call.message.answer(
        text="Расписание на вторник \n<b>Четная неделя</b>\n\n<b>1 пара</b>(9.30-11.05) Авиамоторная  лек.  Правоведение  доц. Антипов А.А. 2-14 нед. ауд.  УЛК-2\n\n<b>2 пара</b>(11.20-12.55) Авиамоторная  лекции   Введение в ИТ ауд. УЛК-2	\n\n<b>3 пара</b>(13.10-14.45) Авиамоторная   лек. Электроника  ст. пр.  Сретенская Н.В. ауд. УЛК-2 \n\n<b>4 пара</b>(15.25-17.00) Авиамоторная  лекции  Экология доц. Ерофеева В.В. 2-12 нед. ауд. УЛК-2 \n\n<b>5 пара</b>(17.15-18.50) Авиамоторная  лек.  Теория вероятностей и МС  доц. Панков К.Н.	ауд. УЛК-2",reply_markup=returns)


@dp.callback_query_handler(weekdays_callback.filter(weekday="wednesday_odd"))
async def wednesday_odd(call: CallbackQuery):
    print("работает до")
    if call.message.chat.id == 767509531:
        await call.answer(cache_time=60)
        await call.message.answer(parse_mode='markdown',text="Расписание на среду\n<b>Нечетная неделя</b>\n\n1 пара</b>(9.30-11.05) Авиамоторная  лек. История развития средств связи   ст. пр. Калабекьянц Н.Э. ауд. УЛК-2\n\n<b>2 пара</b>(11.20-12.55) Авиамоторная  пр.з. История развития средств связи   ст. пр. Калабекьянц Н.Э. ауд. УЛК-2 \n\n<b>3 пара</b>(13.10-14.45)  Авиамоторная   лек. Высшая математика  ст. пр. Александров Ю.Л. Ауд. УЛК-2")
    else:
        await call.message.answer(
            text="Расписание на среду \n<b>Нечетная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Авиамоторная  лек. История развития средств связи   ст. пр. Калабекьянц Н.Э. ауд. УЛК-2 \n\n<b>3 пара</b>(13.10-14.45) Авиамоторная   История развития средств связи пр.з. ауд. УЛК-2\n\n<b>4 пара</b>(15.25-17.00) Авиамоторная   лек. Высшая математика  ст. пр. Александров Ю.Л. Ауд. УЛК-2")


@dp.callback_query_handler(weekdays_callback.filter(weekday="wednesday_even"))
async def wednesday_even(call: CallbackQuery):
    await call.answer(cache_time=60)
    await call.message.answer(
        text="Расписание на среду \n<b>Четная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Авиамоторная  лек. Вычислительная техника  ауд. УЛК-2 ст.пр. Селезнев В.С.\n\n<b>4 пара</b>(15.25-17.00) Авиамоторная   лек. Высшая математика  ст. пр. Александров Ю.Л. Ауд. УЛК-2",reply_markup=returns)



@dp.callback_query_handler(weekdays_callback.filter(weekday="thursday_odd"))
async def thursday_odd(call: CallbackQuery):
    await call.answer(cache_time=60)
    await call.message.answer(
        text="Расписание на четверг \n<b>Нечетная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Правоведение пр.з. доц. Антипов А.А.ауд.404\n\n<b>3 пара</b>(13.10-14.45) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ\n\n<b>4 пара</b>(15.25-17.00) Введение в ИТ лаб. ауд. 224\n\n<b>5 пара</b>(17.15-18.50) Введение в ИТ пр.з. ауд. 224",reply_markup=returns)


@dp.callback_query_handler(weekdays_callback.filter(weekday="thursday_even"))
async def thursday_even(call: CallbackQuery):
    await call.answer(cache_time=60)
    await call.message.answer(
        text="Расписание на четверг \n<b>Четная неделя</b>\n\n<b>2 пара</b>(11.20-12.55) Экология лаб.339\n\n<b>3 пара</b>(13.10-14.45) ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ\n\n<b>4 пара</b>(15.25-17.00) Введение в ИТ лаб. ауд. 224\n\n<b>5 пара</b>(17.15-18.50) Введение в ИТ пр.з. ауд. 224",reply_markup=returns)


@dp.callback_query_handler(weekdays_callback.filter(weekday="friday_odd"))
async def friday_odd(call: CallbackQuery):
    await call.answer(cache_time=60)
    await call.message.answer(
        text="Расписание на пятницу \n<b>Нечетная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Основы компьютерного анализа  ЭЦ лаб.\n\n<b>4 пара</b>(15.25-17.00) Электроника лаб. 525",reply_markup=returns)



@dp.callback_query_handler(weekdays_callback.filter(weekday="friday_even"))
async def friday_even(call: CallbackQuery):
    await call.answer(cache_time=60)
    await call.message.answer(
        text="Расписание на пятницу \n<b>Четная неделя</b>\n\n<b>3 пара</b>(13.10-14.45) Основы компьютерного анализа  ЭЦ лаб.\n\n<b>4 пара</b>(15.25-17.00) Электроника лаб. 525",reply_markup=returns)



@dp.callback_query_handler(weekdays_callback.filter(weekday="return"))
async def return_to_home(call: CallbackQuery):
    await call.answer(cache_time=60)
    await call.message.answer(text="Вы вернулись в меню", reply_markup=menu)